# GetNumericRevisionSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevisionNumberingSequence..::..GetNumericRevisionSettings Method
RevisionNumberingSequence Class See Also
---
Returns a copy of the NumericRevisionSettings owned by this revision numbering sequence.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public NumericRevisionSettings GetNumericRevisionSettings()
```

Visual Basic
---
```text
Public Function GetNumericRevisionSettings As NumericRevisionSettings
```

Visual C++
---
```text
public:
NumericRevisionSettings^ GetNumericRevisionSettings()
```

# ### Return Value
The copy of the NumericRevisionSettings owned by this revision numbering sequence.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This RevisionNumberingSequence doesn't own a valid numeric revision settings. |

# See Also
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace